package 못푼문제;

public class Sol_14500_테트로미노 {

//    static int[][][] block = {
//            {{0, 0}, {0, 1}, {0, 2}, {0, 3}},
//            {{0, 0}, {1, 0}, {2, 0}, {3, 0}},
////          □□□□ 블럭
//            {{0, 0}, {0, 1}, {1, 0}, {1, 1}},
////          □□
////          □□ 블럭
//            {{0, 0}, {0, 1}, {0, 2}, {1, 0}},
//            {{}}
////          □
////          □□□  블럭
//    };
//    아무리 봐도 이건 아니지 ㅋㅋ

//    상 하 좌 우로 방문하지 않은 칸을 가는걸로
//    + ㅗ 모양은 어떻게하지
    public static void main(String[] args) {

    }
}
